$(document).ready(function(){
	$('.openModal').click( function() {
		$('body').css("overflow","hidden");
		$('#ModalFullTextTitle').text('');
		$('.modal-body').text(''); 
		var id = $(this).attr('id');
		if (id == 'card-1'){
			$('#ModalFullTextTitle').text('Початок подорожі');
			$('.modal-body').html('<p>Нині ми відштовхуємося від поодинокої сосни, що все життя провела в пошуках натхнення й за ним могла вирушити у далекі краї, сосна ця зветься Іваном Трушем й корені її проросли вглиб західної землі. Іван Труш мав зв’язки чи не з усіма українськими діячами, що їхні імена викарбувані в серці кожного українця,  а відомі далеко поза межами України. Не кожному художнику пощастило стати справжньою ниткою Аріадни, що веде крізь лабіринт своїх вражень до своїх сенсів, від власних портретів до душі тих, що зображені. Саме за ним ми слідуємо лабіринтом 1938-го.</p>'); 
		}
		if (id == 'card-2'){
			$('#ModalFullTextTitle').text('Артистичний вісник');
			$('.modal-body').html('Із Трушем пов’язане ім’я Станіслава Людкевича, який був диригентом хору «Львівський Боян» саме до 1938-го року, коли його діяльності перешкодив Радянський Союз й назвав хорове товариство «націоналістичним». Разом Труш та Людкевич видавали журнал «Артистичний вісник», де публікувалися критичні й аналітичні статті багатьох письменників того часу, в тому числі Івана Франка. Хорове товариство виникло за ініціативи <b>Володимира Шухевича, який був його першим головою, а також дідом видатного Романа Шухевича.</b>');
		}
		if (id == 'card-3'){
			$('#ModalFullTextTitle').text('Шухевичі');
			$('.modal-body').html('<p>У жовтні 1938 р. постала незалежна Карпатськоукраїнська держава. А за сприяння Романа Шухевича 11 жовтня 1938 р. ОУН організувала велику маніфестацію і кількатисячний демонстраційний похід центром міста з гаслами проти Польщі та Угорщини, що прагнули встановлення спільного кордону у Карпатах шляхом поглинання Підкарпаття. Ця подія сталася після після проведення богослужіння на честь Карпатської  України в соборі св. Юра у Львові та призвела до конфліктних сутичок між демонстрантами та польськими студентами та поліцією. Відразу після маніфестацій та виступів розпочались масові нелегальні переходи галицької молоді через польсько-чехословацький кордон на Закарпаття для участі у тамтешніх державотворчих процесах і вступу до складу парамілітарної організації – Карпатської Січі, що організовувалась там під керівництвом оунівців для оборони краю. Переходи галичан на Закарпаття у вересні 1938-березні 1939 рр.  Організацією переходів восени 1938 р. активно займався також і сам Р. Шухевич. Саме він у цей час намагався взяти на себе відповідальну місію своєрідного посередника між Галичиною та Карпатською Україною.</p><p>Те, що тоді обійшлося, вилилося в арешт Шухевича польською поліцією у листопаді 1938-го року з метою «нейтралізувати керівництво націоналістичного руху».</p>Після виходу на волю до кінця грудня 1938 р. Р. Шухевич активно займається справами Карпатської України на Галичині. Широкі ділові зв’язки з різними провідними громадськими, культурними та військовими діячами, економічними установами та підприємцями Галичини, набуті у 1937-1938 рр. під час роботи у заснованому ним рекламному агентстві «ФАМА» стають в пригоді. Наприкінці грудня 1938 р. він виїжджає до Львова, щоб зацікавити «Молоду Громаду» справою озброєння Карпатської Січі. Українські економічні установи у Львові заявили свою готовність надати у розпорядження штабу Карпатської Січі значні грошові засоби, яких вистачало для закупівлі зброї для 5-6 тис. осіб. Окрім цього, Р. Шухевичу вдалось роздобути чимало легкої зброї, різні військові навчальні матеріали та підручники, зав’язати нові ділові контакти з великим колом громадян і залучити до надання фінансової допомоги Карпатській Україні. Націоналістичні погляди Шухевич перейняв через спілкування з <b>Євгеном Коновальцем, який колись винаймав кімнату в будинку Шухевичів.</b></p>');
		}
		if (id == 'card-4'){
			$('#ModalFullTextTitle').text('Поціновувачу солодощів');
			$('.modal-body').html('<p>У 1938 році Євгена Коновальця пригостить новоспечений товариш-енкаведист Павло Судоплатов, коробкою з цукерками, які Тимашков Олександр створив за останнім рецептом вибухових пристроїв. Відомим фактом для Судоплатова було те, що Коновалець полюбляв солодке. Після такого частування ми назавжди втрачаємо Євгена Коновальця в результаті вибуху бомби. Цей план ліквідації одного з лідерів націоналістичного руху був детально розроблений <b>співробітниками НКВС</b>. Це спричинило розкол у проводі організації між прихильниками опертя на власні сили й тими, хто вважав вирішальним зовнішній чинник, між революційними борцями й опортуністами. 10 лютого 1940 року було сформовано Революційний Провід ОУН на чолі зі <b>Степаном Бандерою</b>.</p>');
		}
		if (id == 'card-5'){
			$('#ModalFullTextTitle').text('Символічна зустріч');
			$('.modal-body').html('<p>Мало кому відомо, але саме на роковинах смерті Євгена Коновальця, біля його могили, яку відвідав Бандера, Степана вперше побачив його вбивця – агент КГБ Богдан Сташинський. Сталося це через 20 років після смерті й поховання Коновальця – у 1958-му.</p>');
		}
		if (id == 'card-6'){
			$('#ModalFullTextTitle').text('Стилет та стилос');
			$('.modal-body').html('<p>Не знав Труш, коли малював своєю рукою Катерину Грушевську, скільки від руки НКВС вона терпітиме. У липні 1938-го року НКВС навідалися до єдиної доньки Михайла Грушевського Катерини, що мала тоді хворі легені, але старанно  над історичними працями. Націоналістичні погляди Катерині Михайлівні висунули звинувачення в участі у «антирадянській українській організації», приписали їй шпигунство. Військовий трибунал визнав Грушевську винною у сприянні антирадянській діяльності української націоналістичної організації з метою «встановлення фашистської диктатури». Її позбавлено волі у виправно-трудовому таборі терміном на вісім років з «поражением прав» на п\'ять років та конфіскацією особистого майна.</p><p>Цього ж року, року арешту й материнського горя, змальовуючи «битком набиту» кімнату доньки, до якої після її арешту з домашньої робітні батька перенесли всі речі й бібліотеку, а також «переселили» з другого поверху дружину <b>Олександра Грушевського</b>, заарештованого тоді ж, мати писала: «Над шкафами висит портрет. На шкафу стоят фотографии и тот букет (сухой, конечно уже) из мальв, которые Ты мне подарила за несколько дней до этого.»</p><p>Кулюня, так її називали близькі, з раннього дитинства була в татуся, швидко все схоплювала й вже в ранньому віці <b>Аріадна Драгоманова навчала її французької.</b></p>');
		}
		if (id == 'card-7'){
			$('#ModalFullTextTitle').text('Однакові долі');
			$('.modal-body').html('<p>Того ж зловісного 1938-го року, вже в серпні, заарештували ще одного Грушевського – Олександра, брата Михайла, дядька Кулюні. Одні й ті самі звинувачення, одні й ті самі наслідки – конфіскація майна та скитання поміж тюремних стін. Вважався одним з керівних учасників антирадянської української націоналістичної терористичної організації, за звинуваченням – проводив підривну роботу на ідеологічному фронті. Винним він себе не визнав і нікого не обмовив. На основі вигаданих свідчень 5 жовтня 1939 Особлива нарада при НКВД СССР засудила його до п\'яти років заслання до таборів Казахстану, де він працював рахівником, перебуваючи під наглядом міліції. Його дружині Ользі довелося відмовитися від вікон, аби розмістити усі історичні й етнографічні праці вченого в хаті, а також жити під страхом арешту через сам факт зберігання.</p>');
		}
		if (id == 'card-8'){
			$('#ModalFullTextTitle').text('Далекий родич');
			$('.modal-body').html('<p>Дев’ятого серпня 1938-го року ще один з великого роду Грушевських не догодив владі – церковний діяч, етнограф та краєзнавець Марко Грушевський. Він був чотириюрідним братом Михайла та Олександра, навчався в Київському університеті Святого Володимира разом із деякими родичами. Був висвячений на священника й довго служив таким у Суботові, але пізніше, через доноси деяких представників духовенства, був звинувачений в українофільській діяльності й підбурюванні селян проти царської влади. Його справу розглядав київський губернатор, а після переміщення до м. Таганча у  1916 році на нього вчинено замах з боку російських чорносотенних сил через українофільство. Унаслідок тиску з боку Державного політичного управління УСРР змушений у 1930 році припинити церковну діяльність і зректися духовного сану. В останні роки життя працював сторожем в артілі інвалідів, хоча продовжував вести наукові записи (вилучені під час арешту). 11 червня 1938 року заарештований і ув\'язнений в Лук\'янівській тюрмі. Відповідно до постанови Особливої трійки НКВС по Київській області від 9 серпня 1938 року розстріляний.</p>');
		}
		if (id == 'card-9'){
			$('#ModalFullTextTitle').text('Сам Михайло Грушевський');
			$('.modal-body').html('<p>Лише у липні 1938-го року, напередодні великої світової події, за 4 роки після його смерті, судову справу на «керівника Українського націоналістичного центру» закрили. Заарештували Михайла Грушевського ще 23 березня 1931р. за управління неіснуючим центром, що з’явився в спільній свідомості ЧК лише як привід для арешту, який нелегко було знайти в діяльності вченої людини, професора. Від свідчень Грушевський відмовлявся, допоки не почув погрозу ув’язнення дочки Катерини, яку таки схоплять, але роками пізніше.</p>');
		}
	});
	$('#ModalFullText').on('hidden.bs.modal', function () {
	    $('body').css("overflow-y","scroll");
	});
	$('.openModal').hover( function() {
		$(this).parent().parent().css("box-shadow","0px 0px 25px rgba(98, 174, 204, 1)");
	}, function() {
    	$(this).parent().parent().css("box-shadow","none");
  	}
	);
});