$(document).ready(function(){
	$('.openModal').click( function() {
		$('body').css("overflow","hidden");
		$('#ModalFullTextTitle').text('');
		$('.modal-body').text(''); 
		var id = $(this).attr('id');
		if (id == 'card-1'){
			$('#ModalFullTextTitle').text('Початок подорожі');
			$('.modal-body').html('<p>Нині ми відштовхуємося від поодинокої сосни, що все життя провела в пошуках натхнення й за ним могла вирушити у далекі краї, сосна ця зветься Іваном Трушем й корені її проросли вглиб західної землі. Іван Труш мав зв’язки чи не з усіма українськими діячами, що їхні імена викарбувані в серці кожного українця,  а відомі далеко поза межами України. Не кожному художнику пощастило стати справжньою ниткою Аріадни, що веде крізь лабіринт своїх вражень до своїх сенсів, від власних портретів до душі тих, що зображені. Саме за ним ми слідуємо лабіринтом 1938-го.</p>'); 
		}
		if (id == 'card-2'){
			$('#ModalFullTextTitle').text('Артистичний вісник');
			$('.modal-body').html('Із Трушем пов’язане ім’я Станіслава Людкевича, який був диригентом хору «Львівський Боян» саме до 1938-го року, коли його діяльності перешкодив Радянський Союз й назвав хорове товариство «націоналістичним». Разом Труш та Людкевич видавали журнал «Артистичний вісник», де публікувалися критичні й аналітичні статті багатьох письменників того часу, в тому числі Івана Франка. Хорове товариство виникло за ініціативи <b>Володимира Шухевича, який був його першим головою, а також дідом видатного Романа Шухевича.</b>');
		}
		if (id == 'card-3'){
			$('#ModalFullTextTitle').text('Шухевичі');
			$('.modal-body').html('<p>У жовтні 1938 р. постала незалежна Карпатськоукраїнська держава. А за сприяння Романа Шухевича 11 жовтня 1938 р. ОУН організувала велику маніфестацію і кількатисячний демонстраційний похід центром міста з гаслами проти Польщі та Угорщини, що прагнули встановлення спільного кордону у Карпатах шляхом поглинання Підкарпаття. Ця подія сталася після після проведення богослужіння на честь Карпатської  України в соборі св. Юра у Львові та призвела до конфліктних сутичок між демонстрантами та польськими студентами та поліцією. Відразу після маніфестацій та виступів розпочались масові нелегальні переходи галицької молоді через польсько-чехословацький кордон на Закарпаття для участі у тамтешніх державотворчих процесах і вступу до складу парамілітарної організації – Карпатської Січі, що організовувалась там під керівництвом оунівців для оборони краю. Переходи галичан на Закарпаття у вересні 1938-березні 1939 рр.  Організацією переходів восени 1938 р. активно займався також і сам Р. Шухевич. Саме він у цей час намагався взяти на себе відповідальну місію своєрідного посередника між Галичиною та Карпатською Україною.</p><p>Те, що тоді обійшлося, вилилося в арешт Шухевича польською поліцією у листопаді 1938-го року з метою «нейтралізувати керівництво націоналістичного руху».</p><p>Після виходу на волю до кінця грудня 1938 р. Р. Шухевич активно займається справами Карпатської України на Галичині. Широкі ділові зв’язки з різними провідними громадськими, культурними та військовими діячами, економічними установами та підприємцями Галичини, набуті у 1937-1938 рр. під час роботи у заснованому ним рекламному агентстві «ФАМА» стають в пригоді. Наприкінці грудня 1938 р. він виїжджає до Львова, щоб зацікавити «Молоду Громаду» справою озброєння Карпатської Січі. Українські економічні установи у Львові заявили свою готовність надати у розпорядження штабу Карпатської Січі значні грошові засоби, яких вистачало для закупівлі зброї для 5-6 тис. осіб. Окрім цього, Р. Шухевичу вдалось роздобути чимало легкої зброї, різні військові навчальні матеріали та підручники, зав’язати нові ділові контакти з великим колом громадян і залучити до надання фінансової допомоги Карпатській Україні. <b>Націоналістичні погляди Шухевич перейняв через спілкування з Євгеном Коновальцем, який колись винаймав кімнату в будинку Шухевичів.</b></p>');
		}
		if (id == 'card-4'){
			$('#ModalFullTextTitle').text('Поціновувачу солодощів');
			$('.modal-body').html('<p>У 1938 році Євгена Коновальця пригостить новоспечений товариш-енкаведист Павло Судоплатов, коробкою з цукерками, які Тимашков Олександр створив за останнім рецептом вибухових пристроїв. Відомим фактом для Судоплатова було те, що Коновалець полюбляв солодке. Після такого частування ми назавжди втрачаємо Євгена Коновальця в результаті вибуху бомби. Цей план ліквідації одного з лідерів націоналістичного руху був детально розроблений <b>співробітниками НКВС.</b></p>');
		}
		if (id == 'card-5'){
			$('#ModalFullTextTitle').text('Стилет та стилос');
			$('.modal-body').html('<p>Не знав Труш, коли малював своєю рукою Катерину Грушевську, скільки від руки НКВС вона терпітиме. У липні 1938-го року НКВС навідалися до єдиної доньки Михайла Грушевського Катерини, що мала тоді хворі легені, але старанно  над історичними працями. Націоналістичні погляди Катерині Михайлівні висунули звинувачення в участі у «антирадянській українській організації», приписали їй шпигунство. Військовий трибунал визнав Грушевську винною у сприянні антирадянській діяльності української націоналістичної організації з метою «встановлення фашистської диктатури». Її позбавлено волі у виправно-трудовому таборі терміном на вісім років з «поражением прав» на п\'ять років та конфіскацією особистого майна.</p><p>Цього ж року, року арешту й материнського горя, змальовуючи «битком набиту» кімнату доньки, до якої після її арешту з домашньої робітні батька перенесли всі речі й бібліотеку, а також «переселили» з другого поверху дружину <b>Олександра Грушевського</b>, заарештованого тоді ж, мати писала: «Над шкафами висит портрет. На шкафу стоят фотографии и тот букет (сухой, конечно уже) из мальв, которые Ты мне подарила за несколько дней до этого.»</p>');
		}

	});
	$('#ModalFullText').on('hidden.bs.modal', function () {
	    $('body').css("overflow-y","scroll");
	});
	$('.openModal').hover( function() {
		$(this).parent().parent().css("box-shadow","0px 0px 25px rgba(98, 174, 204, 1)");
	}, function() {
    	$(this).parent().parent().css("box-shadow","none");
  	}
	);
});